# RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution Property
ParameterTypeId Class See Also
---
"Analytical Surface Resolution"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace